{
  "timestamp": "2026-02-09T08:59:00.608313",
  "stage": "B_chunk_01",
  "source": "Liquidity_PDF_Blessed_TRD (4).pdf",
  "content_chars": 15923,
  "content_preview": "# TRANSCRIPTION OF VISIBLE CONTENT\n\n## Main Title:\n**BLESSED TRADER.**\n\n## Subtitle/Tagline:\n*Your guide to consistency in the industry of fake.*\n\n## Visual Elements:\n- Series of moon phase images showing eclipse progression (5 phases from left to right: crescent, partial eclipse with glow, total eclipse with corona, partial eclipse, crescent)\n- Black background\n- White text\n- Celestial/astronomical theme imagery\n\n---\n\n**NOTE:** This appears to be a title/splash screen or cover page. No trading notes, charts, tables, checklists, or detailed content are visible in this image.\n\nDISCLAIMER\nEverything here are my notes from my trading blog. I am not a financial advisor. This is not financial advice. The content is provided for \ninformational purposes only. To make the best decision that meets your needs please do your own research. All investments carry some \nform of risk. Nothing is guaranteed. Please do not invest money you can not afford to lose.\n\n# VISUAL CONTENT EXTRACTION\n\n## Header/",
  "content_full": "# TRANSCRIPTION OF VISIBLE CONTENT\n\n## Main Title:\n**BLESSED TRADER.**\n\n## Subtitle/Tagline:\n*Your guide to consistency in the industry of fake.*\n\n## Visual Elements:\n- Series of moon phase images showing eclipse progression (5 phases from left to right: crescent, partial eclipse with glow, total eclipse with corona, partial eclipse, crescent)\n- Black background\n- White text\n- Celestial/astronomical theme imagery\n\n---\n\n**NOTE:** This appears to be a title/splash screen or cover page. No trading notes, charts, tables, checklists, or detailed content are visible in this image.\n\nDISCLAIMER\nEverything here are my notes from my trading blog. I am not a financial advisor. This is not financial advice. The content is provided for \ninformational purposes only. To make the best decision that meets your needs please do your own research. All investments carry some \nform of risk. Nothing is guaranteed. Please do not invest money you can not afford to lose.\n\n# VISUAL CONTENT EXTRACTION\n\n## Header/Branding\n- **Logo/Brand**: \"BLESSED TRADER.\"\n- **Tagline**: \"Your guide to consistency in the industry of trade.\"\n- **Visual Element**: Moon phases illustration (crescent, full moon, phases sequence)\n\n## Main Content\n\n### Primary Heading\n**LIQUIDITY**\n\n---\n\n## Page Structure\n- Minimalist layout\n- Black header section with white text\n- White/light background for main content area\n- Single centered heading as primary content\n- Significant white space below heading\n\n---\n\n## Notes\n- This appears to be a title/section page\n- No body text, charts, tables, or additional content visible\n- Clean, professional design aesthetic\n- No checklists, bullet points, or structured data present on this view\n\nWhat you need to know about Liquidity?\nLiquidity: In technical terms Liquidity refers to the degree which market can be quickly \nbought or sold without affecting the asset’s price.\nLiquidity will be above old lows & highs, that’s where the “Smart Money” will be targeting –\nknocking out the liquidity that was resting below these old lows, then seek liquidity above \nold highs.\n\nSimple example of price running the Buy-Side Liquidity \nbefore heading lower.\nPrice expanded to the higher to take out buy stops, why? Because they (the \nInformed Money), will want to sell at a higher price, take the Liquidity and cover \ntheir long positions that they opened to run the price higher.\nSo, they aim at the Liquidity Pool (in this example BSLQ), they open long \npositions to push the price higher into the BS Liquidity Pool, then use that \nLiquidity to cover Long positions, and open Short positions at a higher price.\n\nHigh resistance Liquidity\nWhen we see market making higher highs & higher lows after already running the sell-\nside liquidity, we can’t reasonably expect for price to drop all the way down below the \nmain low to take those stops out. There will be a lot of resistance like:\nBullish orderblocks (unless all of them are already very clearly mitigated and it’s a \n“Trendline Phantom in the making), then doesn’t matter how much liquidity there is \nbelow these main lows.\nIt’s a “high resistance liquidity run”, so in other words, the more time price spent around \nthat area actually making clear, one-sided moves, running sell-side liquidity, etc., the \nmore unlikely that price will drop to the main old low despite the level of liquidity resting \nthere.\n\nLow resistance Liquidity\nWhat retail sees as a “double bottom” area as strong support, what we see is all \nthe sell stops resting below (retail stop losses) – that’s our target and a magnet \nwhere the price will be drawn to.\nAll the double, triple tops & bottoms, consolidations that are slowly going lower \nor higher – that’s our target, that’s what we want to see. We’re not going to trade \naway from these types of lows/highs, we’re going to trade directly into it.\nLow resistance liquidity run is when aggressive acceleration happens leaving \nliquidity void – that’s when everything that builds up to fill it is considered as low \nresistance until price reaches the opposing array’s, so if a big drop happened, and \nprice starts building longs to fill it – it’s a low resistance run until price reaches \nfirst bearish array like a bearish breaker, orderblock, and so on.\n\nRun on Liquidity before retracing\nWhen we know what the Higher TF orderflow is we wait for retracements \nto ride the direction towards the Higher TF draw on Liquidity. It‘s \nimportant to pay attention not only where the price pulls back but also \nwhat it does before pulling back, so there‘re two scenarios:\n1.\nPrice will run Liquidity, give a break of structure and then pull back\n2.\nOr after a strong expansion price will not run any Liquidity, and just \nslowly start to form (in this case) higher highs, higher lows\nSo, when price runs Liquidity before retracing – usually it will pull back \ndeeper + the retracement will take longer AND when price does not run \nLiquidity before retracing, that‘s when it‘s more likely that the pull back \nwon‘t last long, price will reach the first strong opposing level, and \nattack the Higher TF target + the low that price left before pulling back.\n\n# BLESSED TRADER\n**Your guide to consistency in the industry of loss.**\n\n---\n\n## LEFT DIAGRAM - CONCEPTUAL RANGE STRUCTURE\n\n### HIGH RESISTANCE\n**WHEN PRICE HEADS INTO THE PREMIUM AREA WHERE THERE'RE ALL THE BEARISH LEVELS (BARRIERS (PREMIUM POAS))**\n\n*Bearish Premium Array (breaker, orderblock, etc.)*\n\n### LOW RESISTANCE RUN\n**UNTIL PRICE GOES INTO THE PREMIUM SIDE OF THE RANGE AND REACHES PREMIUM BEARISH LEVELS.**\n\n[Simple line chart showing price movement oscillating between high and low resistance zones, with an upward trend in the low resistance zone]\n\n---\n\n## MIDDLE DIAGRAM - CANDLESTICK CHART EXAMPLE\n\n### HIGH RESISTANCE\n*-breaker-*\n*-breaker-*\n\n### LOW RESISTANCE\n**TILL FIRST BEARISH ARRAY IS REACHED**\n\n[Candlestick chart showing price action with bullish movement from low resistance zone breaking into high resistance zone, with two breaker levels marked]\n\n---\n\n## RIGHT DIAGRAM - INVERSE SCENARIO\n\n### LOW RESISTANCE\n**TILL FIRST BULLISH ARRAY IS REACHED**\n\n*+DE*\n\n### HIGH RESISTANCE\n\n[Candlestick chart showing price action with initial upward movement followed by downward trend, demonstrating the inverse of the middle scenario - price moving from high resistance down through low resistance zone]\n\nBAIT AND SLAM\nWhenever you see price not showing any directional one-sided moves, when the \nmomentum is low and price is either forming double, triple bottoms or price \nforms a low then a small higher high & higher low close to it, then another one –\nit’s like the markets are laying cheese below it – that’s what we target, that’s \nwhat we focus on while retail traders try to trade away from it!\nIt’s a smart idea to build a totally separate folder just for Liquidity.\nDo your analysis, explain to yourself what you think happened there save & \ncollect screenshots like that, it will help you to understand where the price is \ndrawn to, which areas act like “magnet”.\n\n# BLESSED TRADER.\n*Your guide to consistency in the industry of loss.*\n\n---\n\n## LEFT CHART - PROTECTED LOW\n\n**RUN ON STOPS**\n\n**BREAK OF STRUCTURE** [shown with dashed horizontal line]\n\n**PROTECTED LOW**\nPrice ran the SSLQ, then expanded higher broke the structure respecting bullish levels (bullish orderflow).\n\n[Chart shows zigzag price pattern with downward trend line, breaking above structure line, with a boxed low area and upward arrow indicating bullish continuation]\n\n---\n\n## MIDDLE CHART\n\n**Low of PDA (Continuous Block, FVG, etc.)**\n**BLOCK OVERLAPPING**\n\n[Chart shows price pattern with gray horizontal zones/blocks, arrows pointing upward and downward showing price interaction with these zones]\n\n---\n\n## RIGHT CHART - UNPROTECTED LOW\n\n**Sell-side liquidity (SSLQ)**\n\n**UNPROTECTED LOW**\nPrice been forming small Higher lows, equal lows do strong & directional moves, the liquidity is building below it (small lows).\n\n[Chart shows zigzag price pattern with horizontal gray zone at top, boxed area highlighting equal lows, followed by strong downward move indicated by arrow, demonstrating failure to protect the low]\n\n# LIQUIDITY ABOVE/BELOW CONSOLIDATION\n\n## Header Text:\n**BLESSED TRADER.**\n\"Your guide to consistency in the industry of trade.\"\n\n## Main Title:\n**LIQUIDITY ABOVE/BELOW CONSOLIDATION**\n\n## Explanatory Text:\nWHEN THE PRICE IS GOING SIDEWAYS (CONSOLIDATING) THE LIQUIDITY (RETAIL STOPS) ARE BUILDING ABOVE & BELOW IT, AND IN MOST CASES PRICE WILL WANT TO SWEEP BOTH SIDES BEFORE PICKING A DIRECTION.\n\n## Left Diagram - Schematic Representation:\n- Simple line chart showing price movement\n- **BUY-SIDE LIQUIDITY** - labeled at upper consolidation area with red shaded box above\n- **SELL-SIDE LIQUIDITY** - labeled at lower consolidation area with red shaded box below\n- Shows price sweeping both liquidity zones before directional move upward\n\n## Right Diagram - Actual Chart Example:\n- Candlestick chart showing real price action\n- **BUY-SIDE LIQUIDITY** - labeled at upper horizontal consolidation zone\n- **SELL-SIDE LIQUIDITY** - labeled at lower horizontal consolidation zone\n- Red shaded boxes marking liquidity sweep zones:\n  - Upper right: above consolidation high\n  - Lower right: below consolidation low\n- Chart demonstrates price sweeping both sides of consolidation range before making directional moves\n\nWhat to do when you have Liquidity on both sides, how to \nknow which side the market is going to choose?\nWhen that’s the case, we focus on the underlying higher time-frame bias. Very \nimportant rule to remember is that higher time-frames are like a “parent” figure \nto the lower ones, meaning that if the 1H orderflow is bullish but there’s a 5min \nconsolidation that is building buy-side liquidity above and sell-side liquidity below \nthere’s a big chance that both sides will get swept, however, the overall direction \nwill stay bullish.\nTo sum up, if we have a clear Daily target that is higher, the 1H orderflow is \nbullish, and 5min time-frame is stuck in a range (example on the right) – price \nwill sweep both sides but keep on going higher until the Daily target is reached \nand or 1H bullish orderflow & structure is broken.\n\nWhere do we look for liquidity despite, clean lows, equal \nlows, consolidations, etc.?\n- Highs & Lows of Asia Session: 08:00 PM to 00:00 AM NY time\n- Highs & Lows of London Session: 02:00 AM to 05:00 AM NY time\n- Highs & Lows of NY Session: 07:00 AM to 10:00 AM NY time\n- Intra-day Highs & Lows before Equity Opening: 09:30 AM NY time\n\nPrice needs to sweep Liquidity before every strong move \nthat’s directional & momentum driven.\nBefore every one-sided, strong move the “Informed Money” will grab the liquidity \nthat’s resting above the highs or below the lows (where retail traders place their \nstop losses) to be able to open large positions.\nWe use this to our advantage by letting price run those Liquidity Pools into one of \nthe levels like a bearish Orderblock (example on the right).\nNotice how aggressively price moves away from that area, that’s the clearest & \nmost obvious sign that the “Smart Money” is involved – price has to run the stops \nand quickly move away from that area.\nIMPORTANT: when price runs a liquidity pool we want to see a strong expansion to \nthe opposite direction right away, if price is not in a rush to leave the liquidity \npool that’s the first sign that price is NOT ready to go. Informed money will hold \nthe price there till there’s enough liquidity swept to take off.\n\n# TRADING CHART CONTENT EXTRACTION\n\n## HEADER/BRANDING\n**BLESSED TRADER.**\n\"Your guide to consistency in the industry of loss.\"\n\n---\n\n## CHART ANNOTATIONS\n\n### ANNOTATION 1 (Top Right Area)\n**RUN ON BSLQ / STOPS**\nRun on the Buyside Liquidity (BSLQ)\nbefore expanding lower.\n\n### ANNOTATION 2 (Middle Left Area)\n**RUN ON SSLQ / STOPS**\nRun on the Sellside Liquidity (SSLQ)\nbefore expanding higher.\n\n---\n\n## VISUAL MARKERS ON CHART\n\n### Highlighted Zones:\n- **Pink/Purple shaded rectangle** (top right area) - marks buyside liquidity zone\n- **Blue shaded rectangle** (middle left area) - marks sellside liquidity zone\n- **Pink/Purple shaded rectangle** (middle right area) - marks another buyside liquidity zone\n- **Pink/Purple shaded rectangle** (right side) - marks another buyside liquidity zone\n\n### Directional Indicators:\n- **Black downward arrows** (▼) - positioned above pink zones indicating expected downward movement after liquidity run\n- **Black upward arrows** (▲) - positioned below blue zone indicating expected upward movement after liquidity run\n\n---\n\n## CHART STRUCTURE\n- Candlestick chart showing price action\n- Green/teal candles (bullish)\n- Black/red candles (bearish)\n- Horizontal reference line across upper portion of chart\n- Time axis visible at bottom (showing times: 14, 12:00, 15, 09:00, 17, 18, 12:00, 19, 12:00, 20, 12:00, 21, 12:00, 22, 09:00, 24, 25)\n\nLIQUIDITY MATRIX\nTo find price exits firstly we must understand the Liquidity Matrix (define the price \nrange before the setup forms).\nWhat’s the dealing range high & the dealing range low? – this is how we define a \nPREMIUM Side of the range and the DISCOUNT side of the range.\nIf the Market is in the Premium – we expect a Sell Program to occur, we want to \nfind the counter levels, opposing Premium/Discount Array’s (PDA’s) to cover our \nposition, and vice versa when the market is in the Discount – we expect a Buy \nProgram to occur, we want to find counter levels, opposing PDA’s to cover our \nposition.\nMain levels we use as exits: Liquidity, FVG, Equilibrium of the range, BISI/SIBI \nmidpoint (CE), opposing breakers, orderblocks.\n\nInternal Liquidity & External Liquidity\nIn simple terms – everything that’s happening inside the current dealing range \nis “Internal Liquidity”, and everything that’s happening outside the current \ndealing range is “External Liquidity”.\nImagine this – you have a dealing range, you bought in the Discount area, price \nstarts expanding higher, reaches Premium side of the range, you take partials \nwhen price trades into a Premium FVG, and then you see price completely \nbreakout above the main (highest) premium level – that’s where price enters \nthe External Liquidity area (example on the right).\n\n# INTERNAL LIQUIDITY - Trading Notes Screenshot\n\n## Chart Analysis\n\n### Top Chart (Price Action Overview)\n- Shows a complete market cycle: uptrend → downtrend → consolidation → uptrend → distribution\n- Clear trending phases with consolidation periods\n- Recent price action shows distribution/topping pattern\n\n### Bottom Chart (Detailed Analysis with Annotations)\n\n**Key Levels Marked:**\n- **Dealing Range High** (top horizontal line)\n- **MT** (marked at upper right)\n- **OB** (marked at upper right, just below MT)\n- **Dealing Range Low** (bottom horizontal line)\n\n**Annotations and Labels:**\n\n1. **\"Dealing Range High\"** (top left area)\n\n2. **\"High - Lower high close to it makes it a low resistance high.\"** (left side, during downtrend phase)\n\n3. **\"*Clean* low resistance highs = Asia Session High BS Liquidity\"** (middle section, with cursor icon 🖱️)\n\n4. **FVG** with cursor icon 🖱️ (marked in middle-right area)\n\n5. **BSLQ** (marked during uptrend phase, left-center)\n\n6. **BMS** (marked near the low, right side)\n\n7. **\"Dealing Range Low\"** (bottom right area)\n\n**Price Action Features:**\n- Multiple swing highs and lows clearly visible\n- Consolidation zones highlighted with gray rectangular boxes\n- Clean candlestick patterns showing internal liquidity concepts\n- Asia session highs identified as liquidity points\n- Fair Value Gaps (FVG) marked\n- Buy Side Liquidity (BSLQ) and Sell Side concepts illustrated\n\n**Concept Focus:**\nThe chart demonstrates **INTERNAL LIQUIDITY** - focusing on liquidity within the dealing range, including:\n- Low resistance highs\n- Asia session highs as BS (Buy Side) liquidity\n- Fair Value Gaps\n- Clean price action setups within established ranges",
  "metadata": {
    "chunk_num": 1,
    "provenance": "pages 1-19",
    "source_type": "VISUAL"
  }
}